In [2]:
#Panel Data aka Pandas
#Series' index has name, np.Array doesn't
#shift tab - information

In [27]:
import numpy as np
import pandas as pd

In [5]:
labels = ['a', 'b', 'c'] #list
my_list = [1, 2, 3] #list
arr = np.array([10, 20, 30]) #np array

d = {'a':10, 'b':20, 'c':30} #2 data, key and element, dictionary

In [10]:
pd.Series(my_list, index = labels)

a    1
b    2
c    3
dtype: int64

In [8]:
pd.Series(my_list)

0    1
1    2
2    3
dtype: int64

In [11]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [12]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series([1, 2, 3], ['A', 'B', 'C'])

A    1
B    2
C    3
dtype: int64

In [24]:
grades_1st = pd.Series([1, 1.5, 1.25], ['TEECE','PS','ACECE7'])
grades_1st

TEECE     1.00
PS        1.50
ACECE7    1.25
dtype: float64

In [25]:
grades_2nd = pd.Series([1.25, 1.25, 1], ['TEECE', 'PS','Seminars'])
grades_2nd

TEECE       1.25
PS          1.25
Seminars    1.00
dtype: float64

In [26]:
grades_1st + grades_2nd

ACECE7       NaN
PS          2.75
Seminars     NaN
TEECE       2.25
dtype: float64

In [29]:
##DataFrame##

In [9]:
from numpy.random import randint

In [29]:
columns= ['S1', 'S2', 'S3', 'S4'] #four columns
index = ['Day1', 'Day2', 'Day3', 'Day4', 'Day5'] #five rows

In [28]:
np.random.seed(14)
data = randint(-100, 100, (5,4))
data

array([[   7,  -12,  -88,   50],
       [ -29,    2,   56,   38],
       [ -39,    9,   54,  -75],
       [ -68,  -96,   38,   38],
       [-100,  -16,   33,  -63]])

In [62]:
df =pd.DataFrame(data, index, columns)
df

       S1  S2  S3  S4
Day1    7 -12 -88  50
Day2  -29   2  56  38
Day3  -39   9  54 -75
Day4  -68 -96  38  38
Day5 -100 -16  33 -63

In [31]:
df['S1'] #1 column - series, 2 column - dataframe

Day1      7
Day2    -29
Day3    -39
Day4    -68
Day5   -100
Name: S1, dtype: int32

In [32]:
type(df['S1'])

pandas.core.series.Series

In [33]:
df['S_average'] = (df['S1'] + df['S2'] + df['S3'] + df['S4'])/4 # add column
df

       S1  S2  S3  S4  S_average
Day1    7 -12 -88  50     -10.75
Day2  -29   2  56  38      16.75
Day3  -39   9  54 -75     -12.75
Day4  -68 -96  38  38     -22.00
Day5 -100 -16  33 -63     -36.50

In [42]:
df.drop('S_average', axis = 1) #need to store

KeyError: "['S_average'] not found in axis"

In [34]:
df.loc['Day1']

S1            7.00
S2          -12.00
S3          -88.00
S4           50.00
S_average   -10.75
Name: Day1, dtype: float64

In [35]:
df.loc[['Day1', 'Day3']]

      S1  S2  S3  S4  S_average
Day1   7 -12 -88  50     -10.75
Day3 -39   9  54 -75     -12.75

In [36]:
df.iloc[0]

S1            7.00
S2          -12.00
S3          -88.00
S4           50.00
S_average   -10.75
Name: Day1, dtype: float64

In [26]:
df.iloc[[0,2]]

      S1  S2  S3  S4
Day1   7 -12 -88  50
Day3 -39   9  54 -75

In [39]:
df.loc[['Day4', 'Day5'],['S1','S2']]

       S1  S2
Day4  -68 -96
Day5 -100 -16

In [43]:
df[df>0]

       S1   S2    S3    S4
Day1  7.0  NaN   NaN  50.0
Day2  NaN  2.0  56.0  38.0
Day3  NaN  9.0  54.0   NaN
Day4  NaN  NaN  38.0  38.0
Day5  NaN  NaN  33.0   NaN

In [47]:
df[df["S1"]>0]

      S1  S2  S3  S4
Day1   7 -12 -88  50

In [48]:
df

       S1  S2  S3  S4
Day1    7 -12 -88  50
Day2  -29   2  56  38
Day3  -39   9  54 -75
Day4  -68 -96  38  38
Day5 -100 -16  33 -63

In [49]:
df[df['S2']>0]['S3'] # get all data with S2 positiona and display value of S3

Day2    56
Day3    54
Name: S3, dtype: int32

In [55]:
df[(df['S1'] > -40) & (df['S4'] > 30)][['S1','S4']]

      S1  S4
Day1   7  50
Day2 -29  38

In [63]:
df.reset_index()

  index   S1  S2  S3  S4
0  Day1    7 -12 -88  50
1  Day2  -29   2  56  38
2  Day3  -39   9  54 -75
3  Day4  -68 -96  38  38
4  Day5 -100 -16  33 -63

In [64]:
newind = ['D1', 'D2', 'D3', 'D4','D5']

In [65]:
df['index'] = newind
df

       S1  S2  S3  S4 index
Day1    7 -12 -88  50    D1
Day2  -29   2  56  38    D2
Day3  -39   9  54 -75    D3
Day4  -68 -96  38  38    D4
Day5 -100 -16  33 -63    D5

In [66]:
df.set_index('index')

        S1  S2  S3  S4
index
D1       7 -12 -88  50
D2     -29   2  56  38
D3     -39   9  54 -75
D4     -68 -96  38  38
D5    -100 -16  33 -63

In [67]:
df.reset_index()

  level_0   S1  S2  S3  S4 index
0    Day1    7 -12 -88  50    D1
1    Day2  -29   2  56  38    D2
2    Day3  -39   9  54 -75    D3
3    Day4  -68 -96  38  38    D4
4    Day5 -100 -16  33 -63    D5

In [68]:
##MISSING DATA

In [69]:
df = pd.DataFrame({'A':[1,2,np.nan,4],
                  'B':[5,np.nan,np.nan,30],
                  'C':[10,20,30,40]})

In [70]:
df

     A     B   C
0  1.0   5.0  10
1  2.0   NaN  20
2  NaN   NaN  30
3  4.0  30.0  40

In [72]:
df.dropna()

     A     B   C
0  1.0   5.0  10
3  4.0  30.0  40

In [73]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [77]:
df.fillna(value=0)

     A     B   C
0  1.0   5.0  10
1  2.0   0.0  20
2  0.0   0.0  30
3  4.0  30.0  40

In [78]:
df.fillna(value=df.mean())

          A     B   C
0  1.000000   5.0  10
1  2.000000  17.5  20
2  2.333333  17.5  30
3  4.000000  30.0  40

In [79]:
df.fillna(value=df.mode())

     A     B   C
0  1.0   5.0  10
1  2.0  30.0  20
2  4.0   NaN  30
3  4.0  30.0  40

In [80]:
##GROUPBY

In [81]:
df = pd.read_csv('Universities.csv')

FileNotFoundError: [Errno 2] File b'Universities.csv' does not exist: b'Universities.csv'

In [ ]:
df.groupby('Year')

In [ ]:
df.groupby('Year', 'Sector').mean()

In [ ]:
df.groupby('Year', 'University').mean()

In [82]:
##OPERATIONS

In [86]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                  'col1':[100,200,300,300,400,500],
                  'col2':['NY','CA','WA','WA','AK','NV']})

In [87]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [88]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [89]:
df_one['col2'].nunique() #number of unique

5

In [90]:
df_one['col2'].value_count()

AttributeError: 'Series' object has no attribute 'value_count'

In [92]:
#drop duplicates
df_one.drop_duplicates

<bound method DataFrame.drop_duplicates of   k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV>

In [97]:
#combining dataframes
features = pd.DataFrame({'Acad':[100,200,300,400,500],
                         'TS':[12,13,14,15,16]})
predictions = pd.DataFrame({'job':[0,1,1,0,1]})

In [98]:
features

   Acad  TS
0   100  12
1   200  13
2   300  14
3   400  15
4   500  16

In [99]:
predictions

   job
0    0
1    1
2    1
3    0
4    1

In [101]:
pd.concat([features,predictions], axis = 1)

   Acad  TS  job
0   100  12    0
1   200  13    1
2   300  14    1
3   400  15    0
4   500  16    1